CT/Term3/diffur/lectures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-10 Thu 16:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Дифференциальные уравнения</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Дифференциальные уравнения</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org07d565c">1. Дифференциальные уравнения</a>
<ul>
<li><a href="#orgb5f0fc6">1.1. Введение. Примеры</a></li>
<li><a href="#org4ed9537">1.2. Ур-я 1-го порядка. Основные понятия</a>
<ul>
<li><a href="#org0d039d2">1.2.1. Ур-я 1-го порядка и его решения</a></li>
<li><a href="#orga6c432a">1.2.2. Форма записи ур-й 1-го порядка</a></li>
<li><a href="#orgcb826a6">1.2.3. Поле направлений и приближенное решение</a></li>
<li><a href="#orge1b58cd">1.2.4. Задача Коши</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org07d565c" class="outline-2">
<h2 id="org07d565c"><span class="section-number-2">1</span> Дифференциальные уравнения</h2>
<div class="outline-text-2" id="text-1">
<p>
Бабушкин Максим Владимирович
<a href="mailto:mvbabushkin@itmo.ru">Send Mail</a>
</p>
</div>
<div id="outline-container-orgb5f0fc6" class="outline-3">
<h3 id="orgb5f0fc6"><span class="section-number-3">1.1</span> Введение. Примеры</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\(F(x, y, y', y', y^{(n)}) = 0\) - дифф. ур-е
<i>Пример</i>:
Груз \(m\) на пружине
\[x(t) = ?\]
\[mg = -k(0 - x_0)\]
\[mg = kx_0\]
\[F_{\sum} = ma\]
\[mg + (-k(x - x_0)) = mx\]
\[kx_0 - kx + kx_0 = mx\]
\[-kx = mx\]
Отв: \(x(t) = A \cdot sin(t \sqrt{\frac{k}{m}} + \phi_0)\)
\(A, \phi_0\) - произвольные постоянные
</p>
</div>
</div>
<div id="outline-container-org4ed9537" class="outline-3">
<h3 id="org4ed9537"><span class="section-number-3">1.2</span> Ур-я 1-го порядка. Основные понятия</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0d039d2" class="outline-4">
<h4 id="org0d039d2"><span class="section-number-4">1.2.1</span> Ур-я 1-го порядка и его решения</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
\(F(x, y, y') = 0\) - дифф. ур-е 1-го порядка (1)
<i>Опр.</i> Решением ур-я (1) на \((a, b)\)
н-ся функция \(\phi \in C(a,b)\)
\(F(x, \phi(x), \phi(x)') = 0\) на \((a, b)\)
(<i>a</i> и <i>b</i> м.б. \(\infty\)) 
<i>Пример</i> 
\[y' = x\]
\[y = \frac{x^2}{2} + C\]
\[\phi(x) = \frac{x^2}{2}\]
\[\phi(x) = \frac{x^2}{2} + 1\]
^~~~ Частичные решения
<i>Опр.</i> Общее решение 
Мн-во всех решений
</p>

<p>
\(y = \frac{x^2}{2} + C\) - общее решение
<i>Опр.</i> Общий интеграл
соотношение вида \(F(x, y, C) = 0\) которое при \(\forall C\) - <i>решение</i>?
</p>
</div>
</div>

<div id="outline-container-orga6c432a" class="outline-4">
<h4 id="orga6c432a"><span class="section-number-4">1.2.2</span> Форма записи ур-й 1-го порядка</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<i>Опр.</i> \(y' = f(x, y)\) - ур-е разрешенное относительно производной
<i>Пр.</i> 
\[y' = -\frac{x}{y}\]
\[y = \sqrt{1 - x^2}\]
Тест
^~~ - решение
</p>

<p>
<i>Опр.</i> \(P(x, y)dx + Q(x, y)dy = 0\)
ур-е в дифференциалах
<i>Опр.</i> Решением ^~~~ н-ся ф-ия \(y(x) \in C(a, b)\)
\(P(x, y(x)) + Q(x, y(x))y'(x) \equiv 0\) на \((a, b)\)
<i>Опр.</i> Параметризованное решение н-ся \(\phi, \psi \in C(\alpha, \beta)\)
</p>
<ol class="org-ol">
<li>\(|\phi'(t)| + |\psi'(t)| = 0\)</li>
<li>\(P(\phi(t), \psi(t))\phi'(t) + Q(\phi(t), \psi(t))\psi'(t) \equiv 0\)</li>
</ol>
<p>
на \((\alpha, \beta)\)
</p>
</div>
</div>
<div id="outline-container-orgcb826a6" class="outline-4">
<h4 id="orgcb826a6"><span class="section-number-4">1.2.3</span> Поле направлений и приближенное решение</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
\[y' = f(x, y)\]
\[f \in C\]
\[G - area\]
\[] \phi - solution\ on\ (a,b)\]
\[\phi'(x) = f(x, \phi(x)) \forall x\]
\[y_0 = \phi(x_0)\]
&phi;'(x<sub>0</sub>) = f(x<sub>0</sub>, y<sub>0</sub>)
\((1, f(x_0, y_0))\) - коллинеарный вектор
</p>

<p>
<i>Опр.</i> Ломаная Ейлера
\(y' = f(x,y)\)
\((x_0, y_0)\) - начальная точка
\(\delta x\) - постоянный ???
</p>
</div>
</div>
<div id="outline-container-orge1b58cd" class="outline-4">
<h4 id="orge1b58cd"><span class="section-number-4">1.2.4</span> Задача Коши</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
<i>Опр.</i> З. Коши (начальной задачей) 
для ур-я \(y' = f(x,y)\) н-ют задачу отыскания его решения удовлетворяющего начальному условию
\(y(x_0) = y_0\)
\((x_0, y_0)\) - начальная точка
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-09-10 Thu 16:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
