Term3/diffur/lectures.tex
% Created 2020-11-03 Tue 22:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}

\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[russian, english]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{grffile}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}
\usepackage[utf8]{inputenc}
\usepackage[russian]{babel}
\date{\today}
\title{Дифференциальные уравнения}
\hypersetup{
 pdfauthor={},
 pdftitle={Дифференциальные уравнения},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Дифференциальные уравнения}
\label{sec:orgc01122d}
Бабушкин Максим Владимирович
\href{mailto:mvbabushkin@itmo.ru}{Send Mail}
\subsection{Введение. Примеры}
\label{sec:org3b1e17e}
\(F(x, y, y', y', y^{(n)}) = 0\) - дифф. ур-е
\emph{Пример}:
Груз \(m\) на пружине
\[x(t) = ?\]
\[mg = -k(0 - x_0)\]
\[mg = kx_0\]
\[F_{\sum} = ma\]
\[mg + (-k(x - x_0)) = mx\]
\[kx_0 - kx + kx_0 = mx\]
\[-kx = mx\]
Отв: \(x(t) = A \cdot sin(t \sqrt{\frac{k}{m}} + \phi_0)\)
\(A, \phi_0\) - произвольные постоянные
\subsection{Ур-я 1-го порядка. Основные понятия}
\label{sec:org1ef285b}
\subsubsection{Ур-я 1-го порядка и его решения}
\label{sec:org34788a9}
\(F(x, y, y') = 0\) - дифф. ур-е 1-го порядка (1)
\emph{Опр.} Решением ур-я (1) на \((a, b)\)
н-ся функция \(\phi \in C(a,b)\)
\(F(x, \phi(x), \phi(x)') = 0\) на \((a, b)\)
(\emph{a} и \emph{b} м.б. \(\infty\)) 
\emph{Пример} 
\[y' = x\]
\[y = \frac{x^2}{2} + C\]
\[\phi(x) = \frac{x^2}{2}\]
\[\phi(x) = \frac{x^2}{2} + 1\]
\^{}\textasciitilde{}\textasciitilde{}\textasciitilde{} Частичные решения
\emph{Опр.} Общее решение 
Мн-во всех решений

\(y = \frac{x^2}{2} + C\) - общее решение
\emph{Опр.} Общий интеграл
соотношение вида \(F(x, y, C) = 0\) которое при \(\forall C\) - \emph{решение}?

\subsubsection{Форма записи ур-й 1-го порядка}
\label{sec:org8ad80de}
\emph{Опр.} \(y' = f(x, y)\) - ур-е разрешенное относительно производной
\emph{Пр.} 
\[y' = -\frac{x}{y}\]
\[y = \sqrt{1 - x^2}\]
Тест
\^{}\textasciitilde{}\textasciitilde{} - решение

\emph{Опр.} \(P(x, y)dx + Q(x, y)dy = 0\)
ур-е в дифференциалах
\emph{Опр.} Решением \^{}\textasciitilde{}\textasciitilde{}\textasciitilde{} н-ся ф-ия \(y(x) \in C(a, b)\)
\(P(x, y(x)) + Q(x, y(x))y'(x) \equiv 0\) на \((a, b)\)
\emph{Опр.} Параметризованное решение н-ся \(\phi, \psi \in C(\alpha, \beta)\)
\begin{enumerate}
\item \(|\phi'(t)| + |\psi'(t)| = 0\)
\item \(P(\phi(t), \psi(t))\phi'(t) + Q(\phi(t), \psi(t))\psi'(t) \equiv 0\)
\end{enumerate}
на \((\alpha, \beta)\)
\subsubsection{Поле направлений и приближенное решение}
\label{sec:orgc7e8705}
\[y' = f(x, y)\]
\[f \in C\]
\[G - area\]
\[] \phi - solution\ on\ (a,b)\]
\[\phi'(x) = f(x, \phi(x)) \forall x\]
\[y_0 = \phi(x_0)\]
\(\phi\)'(x\textsubscript{0}) = f(x\textsubscript{0}, y\textsubscript{0})
\((1, f(x_0, y_0))\) - коллинеарный вектор

\emph{Опр.} Ломаная Ейлера
\(y' = f(x,y)\)
\((x_0, y_0)\) - начальная точка
\(\delta x\) - постоянный ???
\subsubsection{Задача Коши}
\label{sec:org3824dfc}
\emph{Опр.} З. Коши (начальной задачей) 
для ур-я \(y' = f(x,y)\) н-ют задачу отыскания его решения удовлетворяющего начальному условию
\(y(x_0) = y_0\)
\((x_0, y_0)\) - начальная точка
\end{document}
